_drafts/2017-03-08-sumary-of-recent-work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-10 周五 14:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge1e406c">1. Sentry Authentication</a>
<ul>
<li><a href="#orgda4091a">1.1. LDAP Installation</a></li>
<li><a href="#orga2050f7">1.2. Hive Configuration</a></li>
</ul>
</li>
<li><a href="#org4a29beb">2. Hive Debug</a></li>
<li><a href="#orgb0e254f">3. Hive Hook</a>
<ul>
<li><a href="#orgb6fe516">3.1. Hooks lifecycle</a></li>
<li><a href="#orgb2aec2c">3.2. Usage in DDW</a>
<ul>
<li><a href="#org31154f1">3.2.1. ExecuteWithHookContext</a></li>
<li><a href="#orgacb5c1f">3.2.2. AbstractSemanticAnalyzerHook</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
---
layout: default
title: 最近工作总结
---
<div id="outline-container-orge1e406c" class="outline-2">
<h2 id="orge1e406c"><span class="section-number-2">1</span> Sentry Authentication</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgda4091a" class="outline-3">
<h3 id="orgda4091a"><span class="section-number-3">1.1</span> LDAP Installation</h3>
</div>
<div id="outline-container-orga2050f7" class="outline-3">
<h3 id="orga2050f7"><span class="section-number-3">1.2</span> Hive Configuration</h3>
</div>
</div>
<div id="outline-container-org4a29beb" class="outline-2">
<h2 id="org4a29beb"><span class="section-number-2">2</span> Hive Debug</h2>
</div>
<div id="outline-container-orgb0e254f" class="outline-2">
<h2 id="orgb0e254f"><span class="section-number-2">3</span> Hive Hook</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgb6fe516" class="outline-3">
<h3 id="orgb6fe516"><span class="section-number-3">3.1</span> Hooks lifecycle</h3>
<div class="outline-text-3" id="text-3-1">
<p>
There are several types of hooks depending on at which stage you want to inject your custom code:
</p>
<ul class="org-ul">
<li>Driver run hooks (Pre/Post)</li>
<li>Semantic analyizer hooks (Pre/Post)</li>
<li>Execution hooks (Pre/Failure/Post)</li>
<li>Client statistics publisher</li>
</ul>
<p>
If you run a script the processing flow looks like as follows:
</p>
<ol class="org-ol">
<li><b>Driver.run()</b> takes the command</li>
<li><b>HiveDriverRunHook.preDriverRun()</b> <code>HiveConf.ConfVars.HIVE_DRIVER_RUN_HOOKS</code></li>
<li><b>Driver.compile()</b> starts processing the command: creates the abstract syntax tree</li>
<li><b>AbstractSemanticAnalyzerHook.preAnalyze()</b> <code>AbstractSemanticAnalyzerHook.preAnalyze()</code></li>
<li>Semantic analysis</li>
<li><b>AbstractSemanticAnalyzerHook.postAnalyze()</b> <code>HiveConf.ConfVars.SEMANTIC_ANALYZER_HOOK</code></li>
<li>Create and validate the query plan (physical plan)</li>
<li><b>Driver.execute()</b> : ready to run the jobs</li>
<li><b>ExecuteWithHookContext.run()</b>  <code>HiveConf.ConfVars.PREEXECHOOKS</code></li>
<li><b>ExecDriver.execute()</b> runs all the jobs</li>
<li>For each job at every <code>HiveConf.ConfVars.HIVECOUNTERSPULLINTERVAL</code> interval: 
<b>ClientStatsPublisher.run()</b> is called to publish statistics <code>HiveConf.ConfVars.CLIENTSTATSPUBLISHERS</code> 
If a task fails: <b>ExecuteWithHookContext.run()</b> <code>HiveConf.ConfVars.ONFAILUREHOOKS</code></li>
<li>Finish all the tasks</li>
<li><b>ExecuteWithHookContext.run()</b> <code>HiveConf.ConfVars.POSTEXECHOOKS</code></li>
<li>Before returning the result <b>HiveDriverRunHook.postDriverRun()</b> <code>HiveConf.ConfVars.HIVE_DRIVER_RUN_HOOKS</code></li>
<li>Return the result.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb2aec2c" class="outline-3">
<h3 id="orgb2aec2c"><span class="section-number-3">3.2</span> Usage in DDW</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-org31154f1" class="outline-4">
<h4 id="org31154f1"><span class="section-number-4">3.2.1</span> ExecuteWithHookContext</h4>
<div class="outline-text-4" id="text-3-2-1">
<ol class="org-ol">
<li>设置HiveConf的mapreduce.job.queuename值，方便CDH中的资源池管理。</li>
<li>HiveHistory文件追踪，监控Hive SQL的进度</li>
</ol>
<div class="org-src-container">
<pre class="src src-java"> <span style="color: #2aa1ae;">/**</span>
<span style="color: #2aa1ae;"> * 1 ) &#29992;&#20110;&#23558;&#29992;&#25143;&#25552;&#20132;&#21040;&#23545;&#24212;&#30340;pool&#20013;,&#36825;&#26679;&#20415;&#20110;&#32479;&#19968;&#23545;&#26576;&#20010;&#29992;&#25143;&#25191;&#34892;&#36164;&#28304;(mem/cpu)&#20351;&#29992;&#25511;&#21046;,&#38450;&#27490;&#20854;&#21344;&#29992;&#36807;&#22810;&#36164;&#28304;&#21345;&#20303;&#20854;&#20182;job</span>
<span style="color: #2aa1ae;"> * 2 ) &#21019;&#24314;&#20219;&#21153;</span>
<span style="color: #2aa1ae;"> * Created by xkwu on 2017/1/17.</span>
<span style="color: #2aa1ae;"> */</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">CustomExecuteWithHookContext</span> <span style="color: #4f97d7; font-weight: bold;">implements</span> <span style="color: #ce537a; font-weight: bold;">ExecuteWithHookContext</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">Log</span> <span style="color: #7590db;">LOG</span> = LogFactory.getLog<span style="color: #bc6ec5;">(</span>CustomExecuteWithHookContext.<span style="color: #4f97d7; font-weight: bold;">class</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">TailerTracker</span> <span style="color: #7590db;">tailerTracker</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">TailerTracker</span><span style="color: #bc6ec5;">()</span>;

    <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #bc6ec5;">{</span>
        tailerTracker.start<span style="color: #2d9574;">()</span>;
    <span style="color: #bc6ec5;">}</span>
    <span style="color: #a45bad;">@Override</span>
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">run</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">HookContext</span> <span style="color: #7590db;">hookContext</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">Exception</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">try</span> <span style="color: #2d9574;">{</span>
        <span style="color: #ce537a; font-weight: bold;">UserGroupInformation</span> <span style="color: #7590db;">ugi</span> = hookContext.getUgi<span style="color: #67b11d;">()</span>;
        hookContext.getConf<span style="color: #67b11d;">()</span>.set<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"mapreduce.job.queuename"</span>, ugi.getUserName<span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span>;<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">1)&#20462;&#25913;queuename</span>

            <span style="color: #ce537a; font-weight: bold;">QueryPlan</span> <span style="color: #7590db;">queryPlan</span> = hookContext.getQueryPlan<span style="color: #67b11d;">()</span>;
            <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">jobs</span> = Utilities.getMRTasks<span style="color: #67b11d;">(</span>queryPlan.getRootTasks<span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span>.size<span style="color: #67b11d;">()</span>;
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>jobs &gt; <span style="color: #a45bad;">0</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">histFileName</span> = SessionState.get<span style="color: #b1951d;">()</span>.getHiveHistory<span style="color: #b1951d;">()</span>.getHistFileName<span style="color: #b1951d;">()</span>;
                tailerTracker.track<span style="color: #b1951d;">(</span>hookContext.getUserName<span style="color: #4f97d7;">()</span>, histFileName<span style="color: #b1951d;">)</span>;<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">2)&#21019;&#24314;&#30417;&#25511;HiveHistory&#30340;listener</span>
            <span style="color: #67b11d;">}</span>
        <span style="color: #2d9574;">}</span> <span style="color: #4f97d7; font-weight: bold;">catch</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">Exception</span> <span style="color: #7590db;">e</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            LOG.error<span style="color: #67b11d;">(</span>e.getMessage<span style="color: #b1951d;">()</span>, e<span style="color: #67b11d;">)</span>;
        <span style="color: #2d9574;">}</span>
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgacb5c1f" class="outline-4">
<h4 id="orgacb5c1f"><span class="section-number-4">3.2.2</span> AbstractSemanticAnalyzerHook</h4>
<div class="outline-text-4" id="text-3-2-2">
<ol class="org-ol">
<li>禁止drop databases,create databases等操作</li>
<li>将创建未压缩table的语句以邮件的形式发送给管理员</li>
</ol>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #2aa1ae;">/**</span>
<span style="color: #2aa1ae;"> *</span>
<span style="color: #2aa1ae;"> * &#20027;&#35201;&#29992;&#20110;&#36807;&#28388;&#20986;&#21019;&#24314;&#34920;,&#21364;&#19981;&#25351;&#23450;&#37319;&#29992;&#21387;&#32553;&#26684;&#24335;.</span>
<span style="color: #2aa1ae;"> * &#20415;&#20110;&#25105;&#20204;&#21450;&#26102;&#36319;&#36827;&#25351;&#23548;&#19994;&#21153;&#26041;&#20462;&#27491;</span>
<span style="color: #2aa1ae;"> *</span>
<span style="color: #2aa1ae;"> * Created by xkwu on 2017/1/18.</span>
<span style="color: #2aa1ae;"> */</span>
<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">CustomSemanticAnalyzerHook</span> <span style="color: #4f97d7; font-weight: bold;">extends</span> <span style="color: #ce537a; font-weight: bold;">AbstractSemanticAnalyzerHook</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">Log</span> <span style="color: #7590db;">LOG</span> = LogFactory.getLog<span style="color: #bc6ec5;">(</span>CustomSemanticAnalyzerHook.<span style="color: #4f97d7; font-weight: bold;">class</span><span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #ce537a; font-weight: bold;">Pattern</span> <span style="color: #7590db;">pattern</span> = Pattern.compile<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">"(STORED\\s+?AS\\s+?)(parquet|rcfile|orcfile|orc)"</span>, <span style="color: #a45bad;">Pattern</span>.CASE_INSENSITIVE<span style="color: #bc6ec5;">)</span>;   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">&#27491;&#21017;&#21305;&#37197;&#37319;&#29992;&#20102;&#21387;&#32553;&#23384;&#20648;&#26684;&#24335;&#30340;&#34920;scheme</span>

    <span style="color: #a45bad;">@Override</span>
    <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #ce537a; font-weight: bold;">ASTNode</span> <span style="color: #bc6ec5; font-weight: bold;">preAnalyze</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">HiveSemanticAnalyzerHookContext</span> <span style="color: #7590db;">context</span>,
                              <span style="color: #ce537a; font-weight: bold;">ASTNode</span> <span style="color: #7590db;">ast</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">throws</span> <span style="color: #ce537a; font-weight: bold;">SemanticException</span> <span style="color: #bc6ec5;">{</span>
        <span style="color: #4f97d7; font-weight: bold;">switch</span> <span style="color: #2d9574;">(</span>ast.getToken<span style="color: #67b11d;">()</span>.getType<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">HiveParser</span>.TOK_CREATETABLE:
                <span style="color: #ce537a; font-weight: bold;">Matcher</span> <span style="color: #7590db;">m</span> = pattern.matcher<span style="color: #67b11d;">(</span>context.getCommand<span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span>;
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span><span style="color: #a45bad;">!</span>m.find<span style="color: #b1951d;">()</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                    LOG.info<span style="color: #b1951d;">(</span>context.getUserName<span style="color: #4f97d7;">()</span> + <span style="color: #2d9574;">"&#25191;&#34892;&#20102;&#25805;&#20316;: "</span> + context.getCommand<span style="color: #4f97d7;">()</span><span style="color: #b1951d;">)</span>;
                    <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">EmailThread</span><span style="color: #b1951d;">(</span><span style="color: #2d9574;">"/hive/notifyAboutCreateTable"</span>, <span style="color: #2d9574;">"cmd="</span> + context.getCommand<span style="color: #4f97d7;">()</span> + <span style="color: #2d9574;">"&amp;groupCode="</span> + context.getUserName<span style="color: #4f97d7;">()</span><span style="color: #b1951d;">)</span>.start<span style="color: #b1951d;">()</span>;
                <span style="color: #67b11d;">}</span>
                <span style="color: #4f97d7; font-weight: bold;">break</span>;
            <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">HiveParser</span>.TOK_CREATEDATABASE:
            <span style="color: #4f97d7; font-weight: bold;">case</span> <span style="color: #a45bad;">HiveParser</span>.TOK_DROPDATABASE:
                <span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">adminAccount</span> = ConfigUtils.prop.getProperty<span style="color: #67b11d;">(</span><span style="color: #2d9574;">"ADMIN_ACCOUNT"</span><span style="color: #67b11d;">)</span>;
                <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>StringUtils.isEmpty<span style="color: #b1951d;">(</span>context.getUserName<span style="color: #4f97d7;">()</span><span style="color: #b1951d;">)</span> || <span style="color: #a45bad;">!</span>context.getUserName<span style="color: #b1951d;">()</span>.equals<span style="color: #b1951d;">(</span>adminAccount<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">{</span>
                    <span style="color: #4f97d7; font-weight: bold;">throw</span> <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">SemanticException</span><span style="color: #b1951d;">(</span><span style="color: #2d9574;">"Only the admin accounts of ddw bigdata platform can create/drop database."</span><span style="color: #b1951d;">)</span>;
                <span style="color: #67b11d;">}</span>
                <span style="color: #4f97d7; font-weight: bold;">break</span>;
            <span style="color: #4f97d7; font-weight: bold;">default</span>:
                <span style="color: #4f97d7; font-weight: bold;">break</span>;
        <span style="color: #2d9574;">}</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> ast;
    <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-03-10 周五 14:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
